In [76]:
import pandas as pd

LAB 3.1. KHÁM PHÁ DỮ LIỆU

1. Đọc file

In [77]:
path_stocks1 = 'D:\\Năm 2 (2024 - 20250\\Python nâng cao\\Bài tập\\LAB 3\\DATA\\stocks1.csv'
stocks1_df = pd.read_csv(path_stocks1)

2. Hiển thị 5 dòng đầu tiên

In [78]:
print("5 dòng đầu tiên của DataFrame stocks1_df:")
print(stocks1_df.head())

5 dòng đầu tiên của DataFrame stocks1_df:
       date symbol     open     high      low    close   volume
0  01-03-19   AMZN  1655.13  1674.26  1651.00  1671.73  4974877
1  04-03-19   AMZN  1685.00  1709.43  1674.36  1696.17  6167358
2  05-03-19   AMZN  1702.95  1707.80  1689.01  1692.43  3681522
3  06-03-19   AMZN  1695.97      NaN      NaN  1668.95  3996001
4  07-03-19   AMZN  1667.37  1669.75  1620.51  1625.95  4957017

3. Hiển thị kiểu dữ liệu (dtype) của mỗi cột

In [79]:
print("Kiểu dữ liệu của mỗi cột trong stocks1_df:")
print(stocks1_df.dtypes)

Kiểu dữ liệu của mỗi cột trong stocks1_df:
date       object
symbol     object
open      float64
high      float64
low       float64
close     float64
volume      int64
dtype: object

4. Xem thông tin tổng quan (info) của stocks1_df

In [80]:
print("Thông tin tổng quan của stocks1_df:")
stocks1_df.info()

Thông tin tổng quan của stocks1_df:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    15 non-null     object
 1   symbol  15 non-null     object
 2   open    15 non-null     float64
 3   high    13 non-null     float64
 4   low     13 non-null     float64
 5   close   15 non-null     float64
 6   volume  15 non-null     int64
dtypes: float64(4), int64(1), object(2)
memory usage: 972.0+ bytes

In [81]:
#Sử dụng hàm describe(), để thống kê dữ liệu cả dạng số và chuỗi
stocks1_df.describe(include='all')

,date,symbol,open,high,low,close,volume
count,15,15,15.000000,13.000000,13.000000,15.000000,1.500000e+01
unique,5,3,NaN,NaN,NaN,NaN,NaN
top,01-03-19,AMZN,NaN,NaN,NaN,NaN,NaN
freq,3,5,NaN,NaN,NaN,NaN,NaN
mean,NaN,NaN,1001.402000,943.511538,926.775385,998.705333,9.936580e+06
std,NaN,NaN,645.683362,668.389987,655.705275,642.198730,1.036832e+07
min,NaN,NaN,173.870000,174.440000,172.020000,172.500000,1.099289e+06
25%,NaN,NaN,175.815000,176.000000,173.970000,175.690000,1.448182e+06
50%,NaN,NaN,1150.060000,1156.760000,1130.690000,1147.800000,4.957017e+06
75%,NaN,NaN,1661.250000,1669.750000,1620.510000,1647.450000,2.027390e+07
max,NaN,NaN,1702.950000,1709.430000,1689.010000,1696.170000,2.743620e+07

- unique: số giá trị khác nhau
- top: giá trị xuất hiện nhiều nhất (top)
- freq: tần suất của giá trị đó

LAB 3.2. XỬ LÝ DỮ LIỆU NULL

1. Kiểm tra xem trong stocks 1 có dữ liệu Null nào không

In [82]:
print("Kiểm tra dữ liệu Null trong stocks1_df:")
kt_null = stocks1_df.isnull().sum()
print(kt_null)

Kiểm tra dữ liệu Null trong stocks1_df:
date      0
symbol    0
open      0
high      2
low       2
close     0
volume    0
dtype: int64

2. Thay thế dữ liệu Null ở cột higt bằng giá trị trung bình của cột high

In [83]:
tb_high = stocks1_df['high'].mean()
stocks1_df['high'].fillna(tb_high, inplace=True)

D:\TEMP\ipykernel_13028\1009930299.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  stocks1_df['high'].fillna(tb_high, inplace=True)

In [84]:
#Hiển thị DataFrame sau khi thay thế dữ liệu Null ở cột high
print("DataFrame stocks1_df sau khi thay thế dữ liệu Null ở cột high:")
print(stocks1_df.head())

DataFrame stocks1_df sau khi thay thế dữ liệu Null ở cột high:
       date symbol     open         high      low    close   volume
0  01-03-19   AMZN  1655.13  1674.260000  1651.00  1671.73  4974877
1  04-03-19   AMZN  1685.00  1709.430000  1674.36  1696.17  6167358
2  05-03-19   AMZN  1702.95  1707.800000  1689.01  1692.43  3681522
3  06-03-19   AMZN  1695.97   943.511538      NaN  1668.95  3996001
4  07-03-19   AMZN  1667.37  1669.750000  1620.51  1625.95  4957017

3. Thay thế dữ liệu Null ở cột low bằng giá trị trung bình của cột low

In [85]:
tb_low = stocks1_df['low'].mean()
stocks1_df['low'].fillna(tb_low, inplace=True)

D:\TEMP\ipykernel_13028\3884082070.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  stocks1_df['low'].fillna(tb_low, inplace=True)

In [86]:
#kiểm tra lại DataFrame sau khi xử lý Null
print("Kiểm tra lại dữ liệu Null sau khi xử lý:")
after_kl_null = stocks1_df['low'].isnull().sum()
print(after_kl_null)

Kiểm tra lại dữ liệu Null sau khi xử lý:
0

In [87]:
#Kiểm tra lại DataFrame sau khi xử lý Null
print("Kiểm tra lại dữ liệu Null sau khi xử lý:")
after_kl_null = stocks1_df.isnull().sum()
print(after_kl_null)

Kiểm tra lại dữ liệu Null sau khi xử lý:
date      0
symbol    0
open      0
high      0
low       0
close     0
volume    0
dtype: int64

LAB 3.3. GỘP DỮ LIỆU VÀ PHÂN TÍCH CƠ BẢN

1. Đọc file

In [88]:
path_stocks2 = "D:\\Năm 2 (2024 - 20250\\Python nâng cao\\Bài tập\\LAB 3\\DATA\\stocks2.csv"
stocks2_df = pd.read_csv(path_stocks2)

2. Gộp stocks1 và stocks2 thành DataFrame tên là stocks

In [89]:
#Sử dụng phương thức concat() để gộp dữ liệu
#ignore_index=True. khi đặt là True, nó sẽ tạo ra một index mới,
#Tạo lại từ đầu cho DataFrame kết quả từ 0 đến n - 1 (với n là tổng
#số hàng trong DataFrame kết quả).
stocks_df = pd.concat([stocks1_df, stocks2_df], ignore_index=True)

#Hiển thị DataFrame sau khi gộp
print("DataFrame sau khi gộp stocks1_df và stocks2_df:")
print(stocks_df.head())
print("Thông tin tổng quan của DataFrame stocks_df sau khi gộp:")
stocks_df.info()

DataFrame sau khi gộp stocks1_df và stocks2_df:
       date symbol     open         high          low    close   volume
0  01-03-19   AMZN  1655.13  1674.260000  1651.000000  1671.73  4974877
1  04-03-19   AMZN  1685.00  1709.430000  1674.360000  1696.17  6167358
2  05-03-19   AMZN  1702.95  1707.800000  1689.010000  1692.43  3681522
3  06-03-19   AMZN  1695.97   943.511538   926.775385  1668.95  3996001
4  07-03-19   AMZN  1667.37  1669.750000  1620.510000  1625.95  4957017
Thông tin tổng quan của DataFrame stocks_df sau khi gộp:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    25 non-null     object
 1   symbol  25 non-null     object
 2   open    25 non-null     float64
 3   high    25 non-null     float64
 4   low     25 non-null     float64
 5   close   25 non-null     float64
 6   volume  25 non-null     int64
dtypes: float64(4), int64(1), object(2)
memory usage: 1.5+ KB

3. Tính giá trung bình (open, high, low, close) cho mỗi ngày

In [90]:
gia_tb_per_day = stocks_df.groupby('date')[['open', 'high', 'low', 'close']].mean()

#Hiển thi 5 dòng đầu tiên của kết quả
print("giá trung bình (open, high, low, close) cho mỗi ngày:")
print(gia_tb_per_day.head())

giá trung bình (open, high, low, close) cho mỗi ngày:
             open        high         low    close
date
01-03-19  684.770  692.528400  680.446000  688.952
04-03-19  693.940  702.392000  685.126000  694.510
05-03-19  695.664  656.638308  645.395077  695.558
06-03-19  696.502  548.329468  540.373077  690.016
07-03-19  689.460  691.478000  673.860000  677.494

LAB 3.4. KẾT HỢP DỮ LIỆU TỪ NHIỀU NGUỒN

In [91]:
path_companies = 'D:\\Năm 2 (2024 - 20250\\Python nâng cao\\Bài tập\\LAB 3\\DATA\\companies.csv'
companies_df = pd.read_csv(path_companies)

1. Hiển thị 5 dòng đầu của companies

In [92]:
print("5 dòng đầu tiên của companies:")
print(companies_df.head())

5 dòng đầu tiên của companies:
   name  employees headquarters_city headquarters_state
0  AMZN     613300           Seattle                 WA
1  GOOG      98771     Mountain View                 CA
2  AAPL     132000         Cupertino                 CA
3    FB      48268        Menlo Park                 CA
4  TSLA      48016         Palo Alto                 CA

2. Kết hợp stocks và companies dựa trên cột chung là symbol

In [93]:
companies_df.rename(columns={'name': 'symbol'}, inplace=True)
merge_data = pd.merge(stocks_df, companies_df, on='symbol')
merge_data[:5]

,date,symbol,open,high,low,close,volume,employees,headquarters_city,headquarters_state
0,01-03-19,AMZN,1655.13,1674.260000,1651.000000,1671.73,4974877,613300,Seattle,WA
1,04-03-19,AMZN,1685.00,1709.430000,1674.360000,1696.17,6167358,613300,Seattle,WA
2,05-03-19,AMZN,1702.95,1707.800000,1689.010000,1692.43,3681522,613300,Seattle,WA
3,06-03-19,AMZN,1695.97,943.511538,926.775385,1668.95,3996001,613300,Seattle,WA
4,07-03-19,AMZN,1667.37,1669.750000,1620.510000,1625.95,4957017,613300,Seattle,WA

In [94]:
average_close = merge_data.groupby('symbol')['close'].mean().reset_index()
average_close[:5]

  symbol     close
0   AAPL   174.674
1   AMZN  1671.046
2     FB   168.510
3   GOOG  1150.396
4   TSLA   281.904

LAB 3.5. SỬ DỤNG MULTIINDEX VÀ GROUPBY

1. Tạo MultiIndex và Groupby

In [95]:
stocks_df.set_index(['date', 'symbol'], inplace=True)
stocks_df

                    open         high          low    close    volume
date     symbol
01-03-19 AMZN    1655.13  1674.260000  1651.000000  1671.73   4974877
04-03-19 AMZN    1685.00  1709.430000  1674.360000  1696.17   6167358
05-03-19 AMZN    1702.95  1707.800000  1689.010000  1692.43   3681522
06-03-19 AMZN    1695.97   943.511538   926.775385  1668.95   3996001
07-03-19 AMZN    1667.37  1669.750000  1620.510000  1625.95   4957017
01-03-19 AAPL     174.28   175.150000   172.890000   174.97  25886167
04-03-19 AAPL     175.69   177.750000   173.970000   175.85  27436203
05-03-19 AAPL     175.94   176.000000   174.540000   175.53  19737419
06-03-19 AAPL     174.67   175.490000   173.940000   174.52  20810384
07-03-19 AAPL     173.87   174.440000   172.020000   172.50  24796374
01-03-19 GOOG    1124.90  1142.970000  1124.750000  1140.99   1450316
04-03-19 GOOG    1146.99  1158.280000  1130.690000  1147.80   1446047
05-03-19 GOOG    1150.06   943.511538   926.775385  1162.03   1443174
06-03-19 GOOG    1162.49  1167.570000  1155.490000  1157.86   1099289
07-03-19 GOOG    1155.72  1156.760000  1134.910000  1143.30   1166559
01-03-19 FB       162.60   163.132000   161.690000   162.28  11097770
04-03-19 FB       163.90   167.500000   163.830000   167.37  18894689
05-03-19 FB       167.37   171.880000   166.550000   171.26  28187890
06-03-19 FB       172.90   173.570000   171.270000   172.51  21531723
07-03-19 FB       171.50   171.740000   167.610000   169.13  18306504
01-03-19 TSLA     306.94   307.130000   291.900000   294.79  22911375
04-03-19 TSLA     298.12   299.000000   282.780000   285.36  17096818
05-03-19 TSLA     282.00   284.000000   270.100000   276.54  18764740
06-03-19 TSLA     276.48   281.505800   274.390000   276.24  10335485
07-03-19 TSLA     278.84   284.700000   274.250000   276.59   9442483

2. Tính trung bình

In [96]:
grouped = stocks_df.groupby(['date', 'symbol']).agg({
    'open': 'mean',
    'high': 'mean',
    'low': 'mean',
    'close': 'mean',
    'volume': 'mean'
}).reset_index()
grouped

        date symbol     open         high          low    close      volume
0   01-03-19   AAPL   174.28   175.150000   172.890000   174.97  25886167.0
1   01-03-19   AMZN  1655.13  1674.260000  1651.000000  1671.73   4974877.0
2   01-03-19     FB   162.60   163.132000   161.690000   162.28  11097770.0
3   01-03-19   GOOG  1124.90  1142.970000  1124.750000  1140.99   1450316.0
4   01-03-19   TSLA   306.94   307.130000   291.900000   294.79  22911375.0
5   04-03-19   AAPL   175.69   177.750000   173.970000   175.85  27436203.0
6   04-03-19   AMZN  1685.00  1709.430000  1674.360000  1696.17   6167358.0
7   04-03-19     FB   163.90   167.500000   163.830000   167.37  18894689.0
8   04-03-19   GOOG  1146.99  1158.280000  1130.690000  1147.80   1446047.0
9   04-03-19   TSLA   298.12   299.000000   282.780000   285.36  17096818.0
10  05-03-19   AAPL   175.94   176.000000   174.540000   175.53  19737419.0
11  05-03-19   AMZN  1702.95  1707.800000  1689.010000  1692.43   3681522.0
12  05-03-19     FB   167.37   171.880000   166.550000   171.26  28187890.0
13  05-03-19   GOOG  1150.06   943.511538   926.775385  1162.03   1443174.0
14  05-03-19   TSLA   282.00   284.000000   270.100000   276.54  18764740.0
15  06-03-19   AAPL   174.67   175.490000   173.940000   174.52  20810384.0
16  06-03-19   AMZN  1695.97   943.511538   926.775385  1668.95   3996001.0
17  06-03-19     FB   172.90   173.570000   171.270000   172.51  21531723.0
18  06-03-19   GOOG  1162.49  1167.570000  1155.490000  1157.86   1099289.0
19  06-03-19   TSLA   276.48   281.505800   274.390000   276.24  10335485.0
20  07-03-19   AAPL   173.87   174.440000   172.020000   172.50  24796374.0
21  07-03-19   AMZN  1667.37  1669.750000  1620.510000  1625.95   4957017.0
22  07-03-19     FB   171.50   171.740000   167.610000   169.13  18306504.0
23  07-03-19   GOOG  1155.72  1156.760000  1134.910000  1143.30   1166559.0
24  07-03-19   TSLA   278.84   284.700000   274.250000   276.59   9442483.0

3. Sắp xếp dữ liệu theo ngày và mã chứng khoán

In [97]:
grouped.sort_values(by=['date', 'symbol'], inplace=True)

4. Hiển thị kết quả cho 5 ngày đầu

In [98]:
grouped[:5]

       date symbol     open      high      low    close      volume
0  01-03-19   AAPL   174.28   175.150   172.89   174.97  25886167.0
1  01-03-19   AMZN  1655.13  1674.260  1651.00  1671.73   4974877.0
2  01-03-19     FB   162.60   163.132   161.69   162.28  11097770.0
3  01-03-19   GOOG  1124.90  1142.970  1124.75  1140.99   1450316.0
4  01-03-19   TSLA   306.94   307.130   291.90   294.79  22911375.0

LAB 3.6. TẠO VÀ PHÂN TÍCH PIVOT TABLE

1. Tạo Pivot Table

In [100]:
pivot_table = stocks_df.pivot_table(
    values='close', 
    index='date', 
    columns='symbol', 
    aggfunc='mean'
)
pivot_table

symbol      AAPL     AMZN      FB     GOOG    TSLA
date
01-03-19  174.97  1671.73  162.28  1140.99  294.79
04-03-19  175.85  1696.17  167.37  1147.80  285.36
05-03-19  175.53  1692.43  171.26  1162.03  276.54
06-03-19  174.52  1668.95  172.51  1157.86  276.24
07-03-19  172.50  1625.95  169.13  1143.30  276.59

2. Thêm một cột tính tổng volume giao dịch cho mỗi mã chứng khoán (symbol)

In [101]:
total_volume = stocks_df.groupby('symbol')['volume'].sum()
pivot_table.loc['Total Volume'] = total_volume
pivot_table

symbol                AAPL         AMZN           FB        GOOG         TSLA
date
01-03-19      1.749700e+02      1671.73       162.28     1140.99       294.79
04-03-19      1.758500e+02      1696.17       167.37     1147.80       285.36
05-03-19      1.755300e+02      1692.43       171.26     1162.03       276.54
06-03-19      1.745200e+02      1668.95       172.51     1157.86       276.24
07-03-19      1.725000e+02      1625.95       169.13     1143.30       276.59
Total Volume  1.186665e+08  23776775.00  98018576.00  6605385.00  78550901.00

3. Sắp xếp dựa trên tổng giao dịch, từ cao xuống

4. Hiển thị kết quả cho 5 mã chứng khoán có tổng volume cao nhất

In [103]:
pivot_table = pivot_table.sort_values(by='Total Volume', axis=1, ascending=False)
pivot_table[:5]

symbol      AAPL      FB    TSLA     AMZN     GOOG
date
01-03-19  174.97  162.28  294.79  1671.73  1140.99
04-03-19  175.85  167.37  285.36  1696.17  1147.80
05-03-19  175.53  171.26  276.54  1692.43  1162.03
06-03-19  174.52  172.51  276.24  1668.95  1157.86
07-03-19  172.50  169.13  276.59  1625.95  1143.30